using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LiteratureSorter
{
    class Program
    {
        static void Main()
        {
                var data = new Dictionary<string, string>()
                {
                {"Бай Ганьо", "Алеко Константинов "},
                {"Разни хора, разни идеали", "Алеко Константинов "},
                {"Косачи", "Елин Пелин "},
                {"Задушница", "Елин Пелин "},
                {"Гераците", "Елин Пелин "},
                {"Ветрена мелница", "Елин Пелин "},
                {"Андрешко", "Елин Пелин "},
                {"Чорба от греховете на отец Ник", "Елин Пелин "},
                {"Занемелите камбани", "Елин Пелин "},
                {"Мечтатели", "Елин Пелин "},
                {"На оня свят", "Елин Пелин "},
                {"Серафим", "Йордан Йовков "},
                {"Последна радост", "Йордан Йовков "},
                {"Шибил", "Йордан Йовков "},
                {"През чумавото", "Йордан Йовков "},
                {"Индже", "Йордан Йовков "},
                {"Албена", "Йордан Йовков "},
                {"Другоселец", "Йордан Йовков "},
                {"Песента на колелетата", "Йордан Йовков "},
                {"Градушка", "Пейо Яворов "},
                {"Стон", "Пейо Яворов "},
                {"Сенки", "Пейо Яворов "},
                {"Заточеници", "Пейо Яворов "},
                {"Две души", "Пейо Яворов "},
                {"Маска", "Пейо Яворов "},
                {"Ще бъдеш в бяло", "Пейо Яворов "},
                {"Две хубави очи", "Пейо Яворов "},
                {"Песента на човека", "Пейо Яворов "},
                {"Стаята", "Атанас Далчев "},
                {"Болница", "Атанас Далчев "},
                {"Книгите", "Атанас Далчев "},
                {"Камък", "Атанас Далчев "},
                {"Повест", "Атанас Далчев "},
                {"Дяволско", "Атанас Далчев "},
                {"Прозорец", "Атанас Далчев"},
                {"Къщата", "Атанас Далчев"},
                {"Стихии", "Елисавета Багряна"},
                {"Потомка", "Елисавета Багряна"},
                {"Кукувица", "Елисавета Багряна"},
                {"Вечната", "Елисавета Багряна"},
                {"Майце си", "Христо Ботев"},
                {"Към брата си", "Христо Ботев"},
                {"Борба", "Христо Ботев"},
                {"Елегия", "Христо Ботев"},
                {"На прощаване", "Христо Ботев"},
                {"До моето първо либе", "Христо Ботев"},
                {"Хаджи Димитър", "Христо Ботев"},
                {"Обесването на Васил Левски", "Христо Ботев"},
                {"Моята молитва", "Христо Ботев"},
                {"Септември", "Гео Милев"},
                {"Спи градът", "Димчо Дебелянов"},
                {"Пловдив", "Димчо Дебелянов"},
                {"Тиха победа", "Димчо Дебелянов"},
                {"Черна песен", "Димчо Дебелянов"},
                {"Да се завърнеш...", "Димчо Дебелянов"},
                {"Помниш ли, помниш ли...", "Димчо Дебелянов"},
                {"Миг", "Димчо Дебелянов"},
                {"Сиротна песен", "Димчо Дебелянов"},
                {"Един убит", "Димчо Дебелянов"},
                {"Българският език", "Иван Вазов"},
                {"Опълченците на Шипка", "Иван Вазов"},
                {"При Рилския манастир", "Иван Вазов"},
                {"Чичовци", "Иван Вазов"},
                {"Под игото", "Иван Вазов"},
                {"Дядо Йоцо гледа", "Иван Вазов"},
                {"Кочо", "Иван Вазов"},
                {"Паисий", "Иван Вазов"},
                {"Отечество любезно", "Иван Вазов"},
                {"Елате ни вижте", "Иван Вазов"},
                {"Линее нашто поколенье", "Иван Вазов"},
                {"Левски", "Иван Вазов"},
                {"Cis moll", "Пенчо Славейков"},
                {"Ни лъх не дъхва над полени", "Пенчо Славейков"},
                {"Спи езерото", "Пенчо Славейков"},
                {"Самотен гроб в самотен кът", "Пенчо Славейков"},
                {"Ралица", "Пенчо Славейков"},
                {"Ний", "Христо Смирненски"},
                {"Да бъде ден", "Христо Смирненски"},
                {"Йохан", "Христо Смирненски"},
                {"Юноша", "Христо Смирненски"},
                {"Стария музикант", "Христо Смирненски"},
                {"Цветаркаvideo", "Христо Смирненски"},
                {"Зимни вечери", "Христо Смирненски"}
            };
                var engine = new Engine(data);

                engine.Start();
            
        }
    }
}
